# GetTypeIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuplicateTypeNamesHandlerArgs..::..GetTypeIds Method
DuplicateTypeNamesHandlerArgs Class See Also
---
Returns ids of the types with duplicate names.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> GetTypeIds()
```

Visual Basic
---
```text
Public Function GetTypeIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetTypeIds()
```

# See Also
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace